SenyuAsuka/STM32-Smart-Fish-Tank-Connected-to-Onenet/NET/onenet/src/onenet.c
/**
	************************************************************
	************************************************************
	************************************************************
	*	文件名： 	onenet.c
	*
	*	作者： 		张继瑞
	*
	*	日期： 		2017-05-08
	*
	*	版本： 		V1.1
	*
	*	说明： 		与onenet平台的数据交互接口层
	*
	*	修改记录：	V1.0：协议封装、返回判断都在同一个文件，并且不同协议接口不同。
	*				V1.1：提供统一接口供应用层使用，根据不同协议文件来封装协议相关的内容。
	************************************************************
	************************************************************
	************************************************************
**/
#include "stm32f10x.h"
#include "esp8266.h"
#include "cJSON.h"
#include "onenet.h"
#include "mqttkit.h"
#include "base64.h"
#include "hmac_sha1.h"
#include "usart.h"
#include "delay.h"
#include "OLED.h"
#include "relay1.h"
#include "Servo.h" 
#include <string.h>
#include <stdio.h>


#define PROID			"mMCK6UJtcU"
#define ACCESS_KEY		"aUhMTHVIMjJJUUJUMmpqdjdEdEYzcHhSbDVUSjcxQjg="
#define DEVICE_NAME		"YG1"

//extern u8 temp, humi;
extern float PH_Data,TDS_Data;
extern float water_temp;
extern u8 environment_humi;
static unsigned char Heater_Status = 0;
char devid[16];

char key[48];

// [新增] 用于记录舵机当前状态，方便上传给云端同步 (0:关, 1:开)
static unsigned char Servo_Status = 0; 

extern unsigned char esp8266_buf[512];

// 消息请求ID计数器，每次发送消息时自增
static unsigned short g_msg_id = 0;

/*
************************************************************
*	函数名称：	OTA_UrlEncode
*
*	函数功能：	sign需要进行URL编码
*
*	入口参数：	sign：加密结果
*
*	返回参数：	0-成功	其他-失败
*
*	说明：		+			%2B
*				空格		%20
*				/			%2F
*				?			%3F
*				%			%25
*				#			%23
*				&			%26
*				=			%3D
************************************************************
*/
static unsigned char OTA_UrlEncode(char *sign)
{

	char sign_t[40];
	unsigned char i = 0, j = 0;
	unsigned char sign_len = strlen(sign);
	
	if(sign == (void *)0 || sign_len < 28)
		return 1;
	
	for(; i < sign_len; i++)
	{
		sign_t[i] = sign[i];
		sign[i] = 0;
	}
	sign_t[i] = 0;
	
	for(i = 0, j = 0; i < sign_len; i++)
	{
		switch(sign_t[i])
		{
			case '+':
				strcat(sign + j, "%2B");j += 3;
			break;
			
			case ' ':
				strcat(sign + j, "%20");j += 3;
			break;
			
			case '/':
				strcat(sign + j, "%2F");j += 3;
			break;
			
			case '?':
				strcat(sign + j, "%3F");j += 3;
			break;
			
			case '%':
				strcat(sign + j, "%25");j += 3;
			break;
			
			case '#':
				strcat(sign + j, "%23");j += 3;
			break;
			
			case '&':
				strcat(sign + j, "%26");j += 3;
			break;
			
			case '=':
				strcat(sign + j, "%3D");j += 3;
			break;
			
			default:
				sign[j] = sign_t[i];j++;
			break;
		}
	}
	
	sign[j] = 0;
	
	return 0;

}

/*
************************************************************
*	函数名称：	OTA_Authorization
*
*	函数功能：	计算Authorization
*
*	入口参数：	ver：参数组版本号，日期格式，目前仅支持格式"2018-10-31"
*				res：产品id
*				et：过期时间，UTC秒值
*				access_key：访问密钥
*				dev_name：设备名
*				authorization_buf：缓存token的指针
*				authorization_buf_len：缓存区长度(字节)
*
*	返回参数：	0-成功	其他-失败
*
*	说明：		当前仅支持sha1
************************************************************
*/
#define METHOD		"sha1"
static unsigned char OneNET_Authorization(char *ver, char *res, unsigned int et, char *access_key, char *dev_name,
											char *authorization_buf, unsigned short authorization_buf_len, _Bool flag)
{
	
	size_t olen = 0;
	
	char sign_buf[64];								//保存签名的Base64编码结果 和 URL编码结果
	char hmac_sha1_buf[64];							//保存签名
	char access_key_base64[64];						//保存access_key的Base64编码结合
	char string_for_signature[72];					//保存string_for_signature，这个是加密的key

//----------------------------------------------------参数合法性--------------------------------------------------------------------
	if(ver == (void *)0 || res == (void *)0 || et < 1564562581 || access_key == (void *)0
		|| authorization_buf == (void *)0 || authorization_buf_len < 120)
		return 1;
	
//----------------------------------------------------将access_key进行Base64解码----------------------------------------------------
	memset(access_key_base64, 0, sizeof(access_key_base64));
	BASE64_Decode((unsigned char *)access_key_base64, sizeof(access_key_base64), &olen, (unsigned char *)access_key, strlen(access_key));
	//UsartPrintf(USART_DEBUG, "access_key_base64: %s\r\n", access_key_base64);
	
//----------------------------------------------------计算string_for_signature-----------------------------------------------------
	memset(string_for_signature, 0, sizeof(string_for_signature));
	if(flag)
		snprintf(string_for_signature, sizeof(string_for_signature), "%d\n%s\nproducts/%s\n%s", et, METHOD, res, ver);
	else
		snprintf(string_for_signature, sizeof(string_for_signature), "%d\n%s\nproducts/%s/devices/%s\n%s", et, METHOD, res, dev_name, ver);
	//UsartPrintf(USART_DEBUG, "string_for_signature: %s\r\n", string_for_signature);
	
//----------------------------------------------------加密-------------------------------------------------------------------------
	memset(hmac_sha1_buf, 0, sizeof(hmac_sha1_buf));
	
	hmac_sha1((unsigned char *)access_key_base64, strlen(access_key_base64),
				(unsigned char *)string_for_signature, strlen(string_for_signature),
				(unsigned char *)hmac_sha1_buf);
	
	//UsartPrintf(USART_DEBUG, "hmac_sha1_buf: %s\r\n", hmac_sha1_buf);
	
//----------------------------------------------------将加密结果进行Base64编码------------------------------------------------------
	olen = 0;
	memset(sign_buf, 0, sizeof(sign_buf));
	BASE64_Encode((unsigned char *)sign_buf, sizeof(sign_buf), &olen, (unsigned char *)hmac_sha1_buf, strlen(hmac_sha1_buf));

//----------------------------------------------------将Base64编码结果进行URL编码---------------------------------------------------
	OTA_UrlEncode(sign_buf);
	//UsartPrintf(USART_DEBUG, "sign_buf: %s\r\n", sign_buf);
	
//----------------------------------------------------计算Token--------------------------------------------------------------------
	if(flag)
		snprintf(authorization_buf, authorization_buf_len, "version=%s&res=products%%2F%s&et=%d&method=%s&sign=%s", ver, res, et, METHOD, sign_buf);
	else
		snprintf(authorization_buf, authorization_buf_len, "version=%s&res=products%%2F%s%%2Fdevices%%2F%s&et=%d&method=%s&sign=%s", ver, res, dev_name, et, METHOD, sign_buf);
	//UsartPrintf(USART_DEBUG, "Token: %s\r\n", authorization_buf);
	
	return 0;

}

//==========================================================
//	函数名称：	OneNET_RegisterDevice
//
//	函数功能：	在产品中注册一个设备
//
//	入口参数：	access_key：访问密钥
//				pro_id：产品ID
//				serial：唯一设备号
//				devid：保存返回的devid
//				key：保存返回的key
//
//	返回参数：	0-成功		1-失败
//
//	说明：		
//==========================================================
_Bool OneNET_RegisterDevice(void)
{

	_Bool result = 1;
	unsigned short send_len = 11 + strlen(DEVICE_NAME);
	char *send_ptr = NULL, *data_ptr = NULL;
	
	char authorization_buf[144];													//加密的key
	
	send_ptr = malloc(send_len + 240);
	if(send_ptr == NULL)
		return result;
	
	while(ESP8266_SendCmd("AT+CIPSTART=\"TCP\",\"183.230.40.33\",80\r\n", "CONNECT"))
		DelayXms(500);
	
	OneNET_Authorization("2018-10-31", PROID, 1956499200, ACCESS_KEY, NULL,
							authorization_buf, sizeof(authorization_buf), 1);
	
	snprintf(send_ptr, 240 + send_len, "POST /mqtt/v1/devices/reg HTTP/1.1\r\n"
					"Authorization:%s\r\n"
					"Host:ota.heclouds.com\r\n"
					"Content-Type:application/json\r\n"
					"Content-Length:%d\r\n\r\n"
					"{\"name\":\"%s\"}",
	
					authorization_buf, 11 + strlen(DEVICE_NAME), DEVICE_NAME);
	
	ESP8266_SendData((unsigned char *)send_ptr, strlen(send_ptr));
	
	/*
	{
	  "request_id" : "f55a5a37-36e4-43a6-905c-cc8f958437b0",
	  "code" : "onenet_common_success",
	  "code_no" : "000000",
	  "message" : null,
	  "data" : {
		"device_id" : "589804481",
		"name" : "mcu_id_43057127",
		
	"pid" : 282932,
		"key" : "indu/peTFlsgQGL060Gp7GhJOn9DnuRecadrybv9/XY="
	  }
	}
	*/
	
	data_ptr = (char *)ESP8266_GetIPD(250);							//等待平台响应
	
	if(data_ptr)
	{
		data_ptr = strstr(data_ptr, "device_id");
	}
	
	if(data_ptr)
	{
		char name[16];
		int pid = 0;
		
		if(sscanf(data_ptr, "device_id\" : \"%[^\"]\",\r\n\"name\" : \"%[^\"]\",\r\n\r\n\"pid\" : %d,\r\n\"key\" : \"%[^\"]\"", devid, name, &pid, key) == 4)
		{
			UsartPrintf(USART_DEBUG, "create device: %s, %s, %d, %s\r\n", devid, name, pid, key);
			result = 0;
		}
	}
	
	free(send_ptr);
	ESP8266_SendCmd("AT+CIPCLOSE\r\n", "OK");
	
	return result;

}

//==========================================================
//	函数名称：	OneNet_DevLink
//
//	函数功能：	与onenet创建连接
//
//	入口参数：	无
//
//	返回参数：	1-成功	0-失败
//
//	说明：		与onenet平台建立连接
//==========================================================
_Bool OneNet_DevLink(void)
{
	
	MQTT_PACKET_STRUCTURE mqttPacket = {NULL, 0, 0, 0};					//协议包

	unsigned char *dataPtr;
	
	char authorization_buf[160];
	
	_Bool status = 1;
	
	OneNET_Authorization("2018-10-31", PROID, 1956499200, ACCESS_KEY, DEVICE_NAME,
								authorization_buf, sizeof(authorization_buf), 0);
	
	UsartPrintf(USART_DEBUG, "OneNET_DevLink\r\n"
							"NAME: %s,	PROID: %s,	KEY:%s\r\n"
                        , DEVICE_NAME, PROID, authorization_buf);
	
	if(MQTT_PacketConnect(PROID, authorization_buf, DEVICE_NAME, 256, 1, MQTT_QOS_LEVEL0, NULL, NULL, 0, &mqttPacket) == 0)
	{
		ESP8266_SendData(mqttPacket._data, mqttPacket._len);			//上传平台
		
		dataPtr = ESP8266_GetIPD(250);									//等待平台响应
		if(dataPtr != NULL)
		{
			if(MQTT_UnPacketRecv(dataPtr) == MQTT_PKT_CONNACK)
			{
				switch(MQTT_UnPacketConnectAck(dataPtr))
				{
					case 0:UsartPrintf(USART_DEBUG, "Tips:	连接成功\r\n");status = 0;break;
					
					case 1:UsartPrintf(USART_DEBUG, "WARN:	连接失败：协议错误\r\n");break;
					case 2:UsartPrintf(USART_DEBUG, "WARN:	连接失败：非法的clientid\r\n");break;
					case 3:UsartPrintf(USART_DEBUG, "WARN:	连接失败：服务器失败\r\n");break;
					case 4:UsartPrintf(USART_DEBUG, "WARN:	连接失败：用户名或密码错误\r\n");break;
					case 5:UsartPrintf(USART_DEBUG, "WARN:	连接失败：非法链接(比如token非法)\r\n");break;
					
					default:UsartPrintf(USART_DEBUG, "ERR:	连接失败：未知错误\r\n");break;
				}
			}
		}
		
		MQTT_DeleteBuffer(&mqttPacket);								//删包
	}
	else
		UsartPrintf(USART_DEBUG, "WARN:	MQTT_PacketConnect Failed\r\n");
	
	return status;
	
}


unsigned char OneNet_FillBuf(char *buf)
{
    char text[64];
    memset(buf, 0, 256);
    
    // 1. 初始化 JSON 头部
    snprintf(buf, 256, "{\"id\":\"%hu\",\"params\":{", ++g_msg_id);
    
    // 2. PH (float)
    sprintf(text, "\"PH\":{\"value\":%.1f},", PH_Data);
    strcat(buf, text);

    // 3. TDS (强转为整型上传)
    sprintf(text, "\"TDS\":{\"value\":%d},", (int)TDS_Data);
    strcat(buf, text);
    
    // 4. 水温 (float)
    sprintf(text, "\"WaterTemperature\":{\"value\":%.1f},", water_temp);
    strcat(buf, text);
   
    // 5. 照明开关 (bool)
    sprintf(text, "\"LightSwitch\":{\"value\":%s},", relay2_info.Relay2_Status ? "true" : "false");
    strcat(buf, text);
		
    // 6. 环境湿度 
    sprintf(text, "\"EnvHumidity\":{\"value\":%.1f},", (float)environment_humi); //
    strcat(buf, text);

    // 7. 舵机开关 
   sprintf(text, "\"ServoSwitch\":{\"value\":%s},", Servo_Status ? "true" : "false");
    strcat(buf, text);
		
    // 加热开关状态上报
    // 【修正】去掉 %s}, 最后的逗号
    sprintf(text, "\"HeaterSwitch\":{\"value\":%s}", Heater_Status ? "true" : "false");
    strcat(buf, text);
		
    // 8. 封口
    strcat(buf, "}}");
    
    return strlen(buf);
}

//==========================================================
//	函数名称：	OneNet_SendData
//
//	函数功能：	上传数据到平台
//
//	入口参数：	type：发送数据的格式
//
//	返回参数：	无
//
//	说明：		
//==========================================================
void OneNet_SendData(void)
{
	
	MQTT_PACKET_STRUCTURE mqttPacket = {NULL, 0, 0, 0};												//协议包
	
	char buf[256];
	
	short body_len = 0, i = 0;
	
	//UsartPrintf(USART_DEBUG, "Tips:	OneNet_SendData-MQTT\r\n");
	
	memset(buf, 0, sizeof(buf));
	
	body_len = OneNet_FillBuf(buf);																	//获取当前需要发送的数据流的总长度
	
	if(body_len)
	{
		if(MQTT_PacketSaveData(PROID, DEVICE_NAME, body_len, NULL, &mqttPacket) == 0)				//封包
		{
			for(; i < body_len; i++)
				mqttPacket._data[mqttPacket._len++] = buf[i];
			
			ESP8266_SendData(mqttPacket._data, mqttPacket._len);									//上传数据到平台
			//UsartPrintf(USART_DEBUG, "Send %d Bytes\r\n", mqttPacket._len);
			
			MQTT_DeleteBuffer(&mqttPacket);															//删包
		}
		else
			UsartPrintf(USART_DEBUG, "WARN:	EDP_NewBuffer Failed\r\n");
	}
	
}

//==========================================================
//	函数名称：	OneNET_Publish
//
//	函数功能：	发布消息
//
//	入口参数：	topic：发布的主题
//				msg：消息内容
//
//	返回参数：	无
//
//	说明：		
//==========================================================
void OneNET_Publish(const char *topic, const char *msg)
{

	MQTT_PACKET_STRUCTURE mqtt_packet = {NULL, 0, 0, 0};						//协议包
	
	UsartPrintf(USART_DEBUG, "Publish Topic: %s, Msg: %s\r\n", topic, msg);
	
	if(MQTT_PacketPublish(MQTT_PUBLISH_ID, topic, msg, strlen(msg), MQTT_QOS_LEVEL0, 0, 1, &mqtt_packet) == 0)
	{
		ESP8266_SendData(mqtt_packet._data, mqtt_packet._len);					//向平台发送订阅请求
		
		MQTT_DeleteBuffer(&mqtt_packet);										//删包
	}

}

//==========================================================
//	函数名称：	OneNET_Subscribe
//
//	函数功能：	订阅
//
//	入口参数：	无
//
//	返回参数：	无
//
//	说明：		
//==========================================================
void OneNET_Subscribe(void)
{
	
	MQTT_PACKET_STRUCTURE mqtt_packet = {NULL, 0, 0, 0};						//协议包
	
	char topic_buf[56];
	const char *topic = topic_buf;
	
	snprintf(topic_buf, sizeof(topic_buf), "$sys/%s/%s/thing/property/set", PROID, DEVICE_NAME);
	
	UsartPrintf(USART_DEBUG, "Subscribe Topic: %s\r\n", topic_buf);
	
	if(MQTT_PacketSubscribe(MQTT_SUBSCRIBE_ID, MQTT_QOS_LEVEL0, &topic, 1, &mqtt_packet) == 0)
	{
		ESP8266_SendData(mqtt_packet._data, mqtt_packet._len);					//向平台发送订阅请求
		
		MQTT_DeleteBuffer(&mqtt_packet);										//删包
	}

}

//==========================================================
//	函数名称：	OneNet_RevPro
//
//	函数功能：	平台返回数据检测
//
//	入口参数：	dataPtr：平台返回的数据
//
//	返回参数：	无
//
//	说明：		
//==========================================================

void OneNet_RevPro(unsigned char *cmd)
{
    char *req_payload = NULL;
    char *cmdid_topic = NULL;
    unsigned short topic_len = 0, req_len = 0;
    unsigned char qos = 0;
    static unsigned short pkt_id = 0;
    unsigned char type = 0;
    short result = 0;
    cJSON *raw_json = NULL, *params_json = NULL;
    
    // 定义各属性的 JSON 指针
    cJSON *led_json = NULL, *purifier_json = NULL, *pump_json = NULL;
    cJSON *servo_json = NULL;
    cJSON *heater_json = NULL; // [新增] 加热器 JSON 指针

    // 1. 判断 MQTT 报文类型
    type = MQTT_UnPacketRecv(cmd);
    switch(type)
    {
        case MQTT_PKT_PUBLISH: // 接收到平台下发的 Publish 消息（属性设置）
        
            result = MQTT_UnPacketPublish(cmd, &cmdid_topic, &topic_len, &req_payload, &req_len, &qos, &pkt_id);
            if(result == 0)
            {
                UsartPrintf(USART_DEBUG, "Topic: %s, Payload: %s\r\n", cmdid_topic, req_payload);
                
                // 2. 解析 JSON 负载
                raw_json = cJSON_Parse(req_payload);
                if(raw_json != NULL)
                {
                    params_json = cJSON_GetObjectItem(raw_json, "params");
                    if(params_json != NULL)
                    {
                        // --- [新增控制] 1. 处理加热器 (HeaterSwitch) ---
                        // 逻辑：控制 PA6 引脚高低电平
                        heater_json = cJSON_GetObjectItem(params_json, "HeaterSwitch");
                        if(heater_json != NULL)
                        {
                            // cJSON 中 bool 类型表现为 valueint(1/0) 或 type(cJSON_True/False)
                            if(heater_json->valueint == 1 || heater_json->type == cJSON_True) 
                            {
                                GPIO_SetBits(GPIOA, GPIO_Pin_6);  // PA6 置高电平，开启继电器
                                Heater_Status = 1;                // 更新全局状态变量（用于上报同步）
                                UsartPrintf(USART_DEBUG, "Heater ON (PA6 HIGH)\r\n");
                            }
                            else
                            {
                                GPIO_ResetBits(GPIOA, GPIO_Pin_6); // PA6 置低电平，关闭继电器
                                Heater_Status = 0;                 // 更新全局状态变量
                                UsartPrintf(USART_DEBUG, "Heater OFF (PA6 LOW)\r\n");
                            }
                        }

                        // --- 2. 处理舵机 (ServoSwitch) ---
                        servo_json = cJSON_GetObjectItem(params_json, "ServoSwitch");
                        if(servo_json != NULL)
                        {
                            if(servo_json->valueint == 1 || servo_json->type == cJSON_True) 
                            {
                                Servo_SetAngle(180); // 开启：转到 180 度
                                Servo_Status = 1;    
                                UsartPrintf(USART_DEBUG, "Servo ON (180)\r\n");
                            }
                            else
                            {
                                Servo_SetAngle(0);   // 关闭：转到 0 度
                                Servo_Status = 0;    
                                UsartPrintf(USART_DEBUG, "Servo OFF (0)\r\n");
                            }
                        }

                        // --- 3. 处理 LED (模拟下降沿触发) ---
                        led_json = cJSON_GetObjectItem(params_json, "led");
                        if(led_json != NULL)
                        {
                            GPIO_SetBits(GPIOB, GPIO_Pin_13);  
                            DelayXms(10);                      
                            GPIO_ResetBits(GPIOB, GPIO_Pin_13); // 触发下降沿
                            DelayXms(10);                      
                            GPIO_SetBits(GPIOB, GPIO_Pin_13);  
                            UsartPrintf(USART_DEBUG, "LED Triggered\r\n");
                        }
                        
                        // --- 4. 处理水泵 (Pump) ---
                        pump_json = cJSON_GetObjectItem(params_json, "pump");
                        if(pump_json != NULL)
                        {
                            GPIO_SetBits(GPIOB, GPIO_Pin_14); 
                            DelayXms(10);                      
                            GPIO_ResetBits(GPIOB, GPIO_Pin_14);
                            DelayXms(10);                      
                            GPIO_SetBits(GPIOB, GPIO_Pin_14);  
                            UsartPrintf(USART_DEBUG, "Pump Triggered\r\n");
                        }

                        // --- 5. 处理净水器 (Purifier) ---
                        purifier_json = cJSON_GetObjectItem(params_json, "purifier");
                        if(purifier_json != NULL)
                        {
                            GPIO_SetBits(GPIOB, GPIO_Pin_12); 
                            DelayXms(10);                      
                            GPIO_ResetBits(GPIOB, GPIO_Pin_12);
                            DelayXms(10);                      
                            GPIO_SetBits(GPIOB, GPIO_Pin_12);  
                            UsartPrintf(USART_DEBUG, "Purifier Triggered\r\n");
                        }
                    }
                    // 3. 释放 cJSON 内存
                    cJSON_Delete(raw_json);
                }
            }
            break;
        
        case MQTT_PKT_PUBACK:
            UsartPrintf(USART_DEBUG, "Tips: Device Publish Ack\r\n");
            break;
        case MQTT_PKT_SUBACK:
            UsartPrintf(USART_DEBUG, "Tips: Subscribe Success\r\n");
            break;
        default:
            break;
    }

    // 4. 清理工作
    ESP8266_Clear(); // 清空 ESP8266 接收缓存
    if(type == MQTT_PKT_PUBLISH)
    {
        MQTT_FreeBuffer(cmdid_topic); // 释放 MQTT 库生成的内存
        MQTT_FreeBuffer(req_payload);
    }
}
